---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.LevelFailures.StoryAboveNonStoryLevel
source: html/b682892f-b48c-a626-b056-8bc13521685c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.LevelFailures.StoryAboveNonStoryLevel Property

The level set as the Story Above for these levels is no longer a story level. This change will cause these levels to revert to the default Story Above.

## Syntax (C#)
```csharp
public static FailureDefinitionId StoryAboveNonStoryLevel { get; }
```